
* Code
#+BEGIN_SRC cpp :flags -std=c++11
#include <iostream>
enum class truth_enum : int  {
    my_true = 1,
    my_false = 0
};

int main()
{ 
  //using my_true = truth_enum::my_true;
  int x = static_cast<int>( truth_enum::my_true );
  std::cout << x << "\n";
}
#+END_SRC

#+RESULTS:
: 1

* Move a UniquePtr into a Lambda
#+BEGIN_SRC cpp :flags -std=c++11
#include <iostream>
#include <memory>
#include <functional>

template<class Func>
void foo(Func func)
{
  func();
}

int main()
{ 
  std::unique_ptr<int> v{ new int(29) };

  auto f = std::bind( [](std::unique_ptr<int>& f) { std::cout << *f << "\n"; }, std::move(v) );

  foo( std::move(f) );
}
#+END_SRC

#+RESULTS:
: 29

